

// 棒球及时比分玩法id
const BASEBALL_TIMERLY_SCORE_HPID = [
  242, // 独赢
  243, // 让球
  244, // 大小
  245, //主队得分大小
  246, //客队得分大小
  247, //得分单/双
  248, //是否进行加时赛
  249, //前5局让球
  250, //前5局大小
  251, //前5局主队得分大小
  252, //前5局客队得分大小
  273, //前5局胜平负
  274, //{a}-{b}局大小
  275, //第{X}局胜平负
  276, //第{X}局大小
  277, //{a}-{b}局胜平负
  278, //{a}-{b}局让球
  279, //{a}-{b}局单双
  280, //第{X}局让球
  281, //第{X}局{主队}大小
  282, //第{X}局{客队}大小
  283, //第{X}局独赢
  284, //安打总数
  285, //{主队}安打总数
  286, //{客队}安打总数
  287, //第{X}局安打总数
  288, //第{X}局{主队}安打总数
  289, //第{X}局{客队}安打总数
  290, //前5局安打总数
  291, //前5局{主队}安打总数
  292  //前5局{客队}安打总数
];