//篮球可预约盘口值玩法（总分）
const BASKETBALL_BY_APPOINTMENT_total = [
  '2', //总分(不含加时)
  '10',//{主队}总分(不含加时)
  '11',//{客队}总分(不含加时)
  '18',//上半场总分
  '26',//下半场总分
  '38',//总分
  '45',//第1节总分
  '51',//第2节总分
  '57',//第3节总分
  '63',//第4节总分
  '87',//上半场{主队}总分
  '88',//下半场{主队}总分
  '97',//下半场{主队}总分
  '98',//下半场{客队}总分
  '198',//{主队}总分
  '199',//{客队}总分
  '145',
  '146',
  '220',// 球员得分
  '221',// 球员三分球
  '271',// 球员助攻
  '272',// 球员篮板
];
//篮球可预约盘口值玩法(包含让分和总分)
const BASKETBALL_BY_APPOINTMENT = [
  '2', //总分(不含加时)
  '4', //让分(不含加时)
  '10', //{主队}总分(不含加时)
  '11', //{客队}总分(不含加时)
  '18', //上半场总分
  '19', //上半场让分
  '26',//下半场总分
  '38',//总分
  '39',//让分
  '45',//第1节总分
  '46', //第1节让分
  '51', //第2节总分
  '52', //第2节让分
  '57', //第3节总分
  '58', //第3节让分
  '63', //第4节总分
  '64', //第4节让分
  '87', //上半场{主队}总分
  '88', //下半场{主队}总分
  '97', //上半场{客队}总分
  '98', //下半场{客队}总分
  '143', //下半场让分
  '198', //{主队}总分
  '199', //{客队}总分
  '145',
  '146',
  '220',// 球员得分
  '221',// 球员三分球
  '271',// 球员助攻
  '272',// 球员篮板
];
//篮球可预约盘口值玩法（让分）
const BASKETBALL_BY_APPOINTMENT_let = [
  '4', //让分(不含加时)
  '19', //上半场让分
  '39', //让分
  '46', //第1节让分
  '52', //第2节让分
  '58', //第3节让分
  '64', //第4节让分
  '143', //下半场让分
];

// 篮球即时比分对应的玩法id
const BASKETBALL_TIMERLY_SCORE_HPID = [
  1, //全场胜平负(不含加时)
  2, //总分(不含加时)
  3, //让分胜平负(不含加时)
  4, //让分(不含加时)
  5, //全场独赢(不含加时)
  10,//{主队}总分(不含加时)
  11,//{客队}总分(不含加时)
  15,//总分单/双(不含加时)
  17,//上半场胜平负
  18,//上半场总分
  19,//上半场让分
  25,//下半场胜平负
  26,//下半场总分
  37,//全场独赢
  38,//总分
  39,//让分
  40,//总分单/双
  41,//是否进行加时赛
  42,//上半场总分单/双
  43,//上半场独赢
  44,//第1节胜平负
  45,//第1节总分
  46,//第1节让分
  47,//第1节总分单/双
  48,//第1节独赢
  49,//第1节净胜分
  50,//第2节胜平负
  51,//第2节总分
  52,//第2节让分
  53,//第2节总分单/双
  54,//第2节独赢
  55,//第2节净胜分
  56,//第3节胜平负
  57,//第3节总分
  58,//第3节让分
  59,//第3节总分单/双
  60,//第3节独赢
  61,//第3节净胜分
  62,//第4节胜平负
  63,//第4节总分
  64,//第4节让分
  65,//第4节总分单/双
  66,//第4节独赢
  67,//第4节净胜分
  75,//半场总分单/双
  87,//上半场{主队}总分
  88,//下半场{主队}总分
  97,//上半场{客队}总分
  98,//下半场{客队}总分
  104,//半/全场(不含加时)
  141,//净胜分(不含加时)
  142,//下半场独赢
  143,//下半场让分
  145,//第{X}节{主队}总分
  146,//第{X}节{客队}总分
  147,//第{X}节首先获得{Y}分(三项)
  198,//{主队}总分
  199,//{客队}总分
  200,//净胜分
  201,//首先获得{Y}分
  209,//净胜分 6项
  210,//净胜分 7项
  211,//净胜分 12项
  212,//净胜分 14项
  213,//最高得分的小节
  214,//谁先获得第{X}分
  215,//第{X}节首先获得{Y}分
  216,//独赢 & 总分
  217,//准确总分大小(不含加时)
  218,//总分区间(不含加时)
  219,//上半场净胜分
  220,//球员得分
  221,//球员三分球
  271,//球员助攻
  272,//球员篮板
  10001,//冠军
  10013,//最有价值球员
  10014 //决赛对阵球队
];