
// 球种玩法对应的比分
const SPORT_PLAY_TO_SCROE = {
  // 足球
  "1": {
    "1":"S1", //全场独赢
    "2":"S1", //全场大小
    "3":"S1", //全场让球胜平负
    "4":"S1", //全场让球
    "5":"S1", //平局退款
    "6":"S1", //双重机会
    "7":"S1", //全场比分
    "8":"S1", //{主队}准确进球数
    "9":"S1", //{客队}准确进球数
    "10":"S1", //{主队}进球大小
    "11":"S1", //{客队}进球大小
    "12":"S1", //两队都进球
    "13":"S1", //独赢 & 进球大小
    "14":"S1", //准确进球数
    "15":"S1", //进球单/双
    "16":"S1", //最多进球的半场
    "17":"S2,S3", //半场独赢
    "18":"S2,S3", //半场大小
    "19":"S2,S3", //半场让球
    "20":"S2", //上半场比分
    "21":"S2", //上半场{主队}准确进球数
    "22":"S2", //上半场{客队}准确进球数
    "23":"S2", //上半场准确进球数
    "24":"S2", //上半场两队都进球
    "25":"S3", //下半场独赢
    "26":"S3", //下半场大小
    "27":"S1", //剩余时间获胜
    "28":"S1", //第{X}个进球
    '336':'S1',//第{X}个进球（无进球退款）
    "29":"S2", //上半场剩余时间获胜
    "30":"S2", //上半场第{X}个进球
    "31":"S1", //第{X}个进球何时发生？
    "32":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-独赢({a}-{b})
    "33":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-让球({a}-{b})
    "34":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-大小({a}-{b})
    "35":"S1", //首个进球球员
    "36":"S1", //任意时间进球球员
    "42":"S2", //上半场进球单/双
    "43":"S2", //上半场平局退款
    "68":"S1", //总进球数区间
    "69":"S2", //上半场让球胜平负
    "70":"S2", //上半场双重机会
    "71":"S3", //下半场让球胜平负
    "72":"S3", //下半场双重机会
    "73":"S3", //下半场准确进球数
    "74":"S3", //下半场比分
    "75":"S3", //下半场进球单/双
    "76":"S3", //下半场两队都进球
    "77":"S1", //{主队}获胜退款
    "78":"S1", //{主队}进球单/双
    "79":"S1", //{客队}零失球
    "80":"S1", //{客队}零失球获胜
    "81":"S1", //{主队}零失球
    "82":"S1", //{主队}零失球获胜
    "83":"S1", //{主队}上/下半场全胜
    "84":"S1", //{主队}任意半场获胜
    "85":"S1", //{主队}最高得分半场
    "86":"S1", //{主队}上/下半场均进球
    "87":"S2", //上半场{主队}进球大小
    "88":"S3", //下半场{主队}进球大小
    "89":"S3", //下半场{主队}零失球
    "90":"S2", //上半场{主队}零失球
    "91":"S1", //{客队}获胜退款
    "92":"S1", //{客队}进球单/双
    "93":"S1", //{客队}上/下半场全胜
    "94":"S1", //{客队}任意半场获胜
    "95":"S1", //{客队}最高得分半场
    "96":"S1", //{客队}上/下半场均进球
    "97":"S2", //上半场{客队}进球大小
    "98":"S3", //下半场{客队}进球大小
    "99":"S3", //下半场{客队}零失球
    "100":"S2", //上半场{客队}零失球
    "101":"S1", //独赢 & 两队都进球
    "102":"S1", //进球大小 & 两队都进球
    "103":"S1", //半/全场比分
    "104":"S1", //半/全场
    "105":"S2", //上半场独赢 & 上半场两队都进球
    "106":"S3", //下半场独赢 & 下半场两队都进球
    "107":"S1", //双重机会 & 两队都进球
    "108":"S1", //上/下半场两队都进球
    "109":"S1", //上/下半场进球数均大于{X.5}
    "110":"S1", //上/下半场进球数均小于{X.5}
    "111":"S555", //角球独赢
    "112":"S555", //最后一个角球
    "113":"S555", //角球让球
    "114":"S555", //角球大小
    "115":"S555", //{主队}角球大小
    "116":"S555", //{客队}角球大小
    "117":"S555", //角球总数区间
    "118":"S555", //角球单/双
    "119":"S15", //上半场角球独赢
    "120":"S15", //上半场第{X}个角球
    "121":"S15", //上半场角球让球
    "122":"S15", //上半场角球大小
    "123":"S15", //上半场{主队}角球大小
    "124":"S15", //上半场{客队}角球大小
    "125":"S555", //谁先获得{X}个角球
    "126":"S7", //加时赛-独赢
    "127":"S7", //加时赛-大小
    "128":"S7", //加时赛-让球
    "129":"S701", //加时赛-上半场独赢
    "130":"S701", //加时赛-上半场让球
    "131":"S1",	//是否进行点球大战
    "132":"S170", //点球大战-独赢
    "133":"S170", //点球大战-第{X}个点球是否射进
    "134":"S170", //点球大战-大小
    "135":"S1", //晋级球队
    "136":"S1", //谁会在决赛中获胜
    "137":"S1", //获胜方式
    "138":"S11", //比赛中出现红牌
    "139":"S11", //{主队}获得红牌
    "140":"S11", //{客队}获得红牌
    "141":"S1", //净胜分
    "142":"S3", //下半场平局退款
    "143":"S3", //下半场让球
    "144":"S1", //谁先开球
    "148":"S1", //第{X}个进球球员
    "149":"S1", //最后进球队伍
    "150":"S1", //最后进球球员
    "151":"S1", //进2+球的球员
    "152":"S1", //进3+球的球员
    "222":"S1", //第{X}个进球方式
    "223":"S1", //谁会进球
    "224":"S10101", //第{X}张罚牌
    "225":"S555", //第{X}个角球
    "226":"S555", //{主队}角球总数区间
    "227":"S555", //{客队}角球总数区间
    "228":"S15", //上半场角球总数区间
    "229":"S15", //上半场角球单/双
    "230":"S15", //上半场谁先获得{X}个角球
    "231":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-独赢({a}-{b})
    "232":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-让球({a}-{b})
    "233":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-大小({a}-{b})
    "234":"S7", //加时赛是否进球
    "235":"S7", //加时赛-第{X}个进球
    "236":"S7", //加时赛-正确比分
    "237":"S170", //点球大战-第{X}个进球
    "238":"S170", //点球大战-净胜分
    "239":"S170", //点球大战-准确进球数
    "240":"S170", //点球大战-单/双
    "241":"S170", //点球大战-正确比分
    "269":"S1", //全场让球
    "270":"S2,S3", //半场让球
    "306":"S10101", //罚牌让分
    "307":"S10101", //罚牌大小
    "308":"S10103", //上半场罚牌让分
    "309":"S10103", //上半场罚牌大小
    "310":"S10101", //罚牌独赢
    "311":"S10103", //上半场罚牌独赢
    "312":"S10101", //罚牌单/双
    "313":"S10103", //上半场罚牌单/双
    "314":"S10101", //{主队}罚牌大小
    "315":"S10101", //{客队}罚牌大小
    "316":"S10103", //上半场{主队}罚牌大小
    "317":"S10103", //上半场{客队}罚牌大小
    "318":"S10101", //准确罚牌分数
    "319":"S10103", //上半场准确罚牌分数
    "320":"S10101", //{主队}准确罚牌分数
    "321":"S10101", //{客队}准确罚牌分数
    "322":"S10103", //上半场{主队}准确罚牌分数
    "323":"S10103", //上半场{客队}准确罚牌分数
    "324":"S12", //黄牌让分
    "325":"S12", //黄牌大小
    "326":"S12", //黄牌独赢
    "327":"S14", //上半场黄牌让分
    "328":"S14", //上半场黄牌大小
    "329":"S14", //上半场黄牌独赢
    "330":"S7", //加时赛-单/双
    "331":"S5", //加时赛-角球大小
    "332":"S701", //加时赛-上半场大小
    "333":"S17005",//点球大战-前5轮独赢
    "334":"S170",//点球大战-让球
    "335":"S17005",//点球大战-前5轮大小
    "367":"S1",//全场反波胆
    "368":"S1",//上半场反波胆
    "369":"S1",//下半场反波胆
    "370":"S1",// 15分钟玩法罚牌独赢
    "371":"S1",// 15分钟玩法罚牌让球
    "372":"S1",//15分钟玩法罚牌大小
    "373":"S1",//上半场{主队}进球单/双
    "374":"S1",//上半场{客队}进球单/双
    "375":"S1",//上半场{主队}零失球获胜
    "376":"S1",//上半场{客队}零失球获胜
    "377":"S1",//下半场{主队}进球单/双
    "378":"S1",//下半场{客队}进球单/双
    "381":"S1",///下半场{主队}零失球获胜
    "382":"S1",//下半场{客队}零失球获胜


  },
  // 篮球
  "2": {
    "1":"S1", //全场胜平负(不含加时)
    "2":"S1", //总分(不含加时)
    "3":"S1", //让分胜平负(不含加时)
    "4":"S1", //让分(不含加时)
    "5":"S1", //全场独赢(不含加时)
    "10":"S1", //{主队}总分(不含加时)
    "11":"S1", //{客队}总分(不含加时)
    "15":"S1", //总分单/双(不含加时)
    "17":"S2", //上半场胜平负
    "18":"S2", //上半场总分
    "19":"S2", //上半场让分
    "25":"S3", //下半场胜平负
    "26":"S3", //下半场总分
    "37":"S1", //全场独赢
    "38":"S1", //总分
    "39":"S1", //让分
    "40":"S1", //总分单/双
    "41":"S1", //是否进行加时赛
    "42":"S2", //上半场总分单/双
    "43":"S2", //上半场独赢
    "44":"S19", //第1节胜平负
    "45":"S19", //第1节总分
    "46":"S19", //第1节让分
    "47":"S19", //第1节总分单/双
    "48":"S19", //第1节独赢
    "49":"S19", //第1节净胜分
    "50":"S20", //第2节胜平负
    "51":"S20", //第2节总分
    "52":"S20", //第2节让分
    "53":"S20", //第2节总分单/双
    "54":"S20", //第2节独赢
    "55":"S20", //第2节净胜分
    "56":"S21", //第3节胜平负
    "57":"S21", //第3节总分
    "58":"S21", //第3节让分
    "59":"S21", //第3节总分单/双
    "60":"S21", //第3节独赢
    "61":"S21", //第3节净胜分
    "62":"S22", //第4节胜平负
    "63":"S22", //第4节总分
    "64":"S22", //第4节让分
    "65":"S22", //第4节总分单/双
    "66":"S22", //第4节独赢
    "67":"S22", //第4节净胜分
    "75":"S3", //下半场总分单/双
    "87":"S2", //上半场{主队}总分
    "88":"S3", //下半场{主队}总分
    "97":"S2", //上半场{客队}总分
    "98":"S3", //下半场{客队}总分
    "104":"S1", //半/全场(不含加时)
    "141":"S1", //净胜分(不含加时)
    "142":"S3", //下半场独赢
    "143":"S3", //下半场让分
    "145":"S19,S20,S21,S22", //第{X}节{主队}总分
    "146":"S19,S20,S21,S22", //第{X}节{客队}总分
    "147":"S19,S20,S21,S22", //第{X}节首先获得{Y}分(三项)
    "198":"S1", //{主队}总分
    "199":"S1", //{客队}总分
    "200":"S1", //净胜分
    "201":"S1", //首先获得{Y}分
    "209":"S1", //净胜分 6项
    "210":"S1", //净胜分 7项
    "211":"S1", //净胜分 12项
    "212":"S1", //净胜分 14项
    "213":"S1", //最高得分的小节
    "214":"S1", //谁先获得第{X}分
    "215":"S19,S20,S21,S22", //第{X}节首先获得{Y}分
    "216":"S1", //独赢 & 总分
    "217":"S1", //准确总分大小(不含加时)
    "218":"S1", //总分区间(不含加时)
    "220":"S1", //球员得分
    "221":"S1", //球员三分球
    "271":"S1", //球员助攻
    "272":"S1", //球员篮板
  },
  // 棒球
  "3": {
    "242":"S1",
    "243":"S1",
    "244":"S1",
    "245":"S1", // 全场比分
    "246":"S1", // 全场比分
    "247":"S1", // 全场比分
    "248":"S1", // 全场比分
    "249":"S1", // 全场比分
    "250":"S1", // 全场比分
    "251":"S1", // 全场比分
    "252":"S1", // 全场比分
    "273":"S1", // 全场比分
    "274":"S1", // 全场比分
    "275":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "276":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "277":"S1", // 全场比分
    "278":"S1", // 全场比分
    "279":"S1", // 全场比分
    "280":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "281":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "282":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "283":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "284":"S3015", // 安打比分
    "285":"S3015", // 安打比分
    "286":"S3015", // 安打比分
    "287":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    "288":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    "289":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    // "284":"S3015",
    // "285":"S3015",
    // "286":"S3015",
    "290":"S3015",
    "291":"S3015",
    "292":"S3015"
  },
  // 乒乓球
  "8":{
    "153":"S1", //全场比分
    "172":"S1", //全场比分
    "173":"S1", //全场比分
    "174":"S1", //全场比分
    "204":"S1", //全场比分
    "175":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "176":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "177":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "178":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "179":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "203":"S120,S121,S122,S123,S124,S125,S126" //第X局的比分
  },
  //排球
  "9":{
    "153": "S1", // 全场比分
    "159": "S1", // 全场比分
    "204": "S1", // 全场比分
    "172": "S1", // 全场比分
    "173": "S1", // 全场比分
    "162": "S120,S121,S122,S123,S124", // 第X局分
    "253": "S120,S121,S122,S123,S124", // 第X局分
    "254": "S120,S121,S122,S123,S124", // 第X局分
    "255": "S120,S121,S122,S123,S124", // 第X局分
    "256": "S120,S121,S122,S123,S124" // 第X局分
  }
};
